---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Width
zh: 宽度
source: html/f5802665-8333-8fe1-88fd-241a63d3ff6d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Width Property

**中文**: 宽度

The width of the analytical rectangular geometry.

## Syntax (C#)
```csharp
public double Width { get; }
```

## Remarks
The product of width and height should be equal to the area
 of the polyloop for the opening. The width is adjusted to accomplish this.